tylertms/dspic33e-sim/conformance/spi.c
static void receive_only_cases(SpiConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint8_t master;
        for (master = 0u; master < 2u; master++) {
            uint8_t mode16;
            for (mode16 = 0u; mode16 < 2u; mode16++) {
                uint16_t base = bases[channel];
                uint16_t control = (uint16_t)(0x081bu | ((uint16_t)master << 5u) |
                                              ((uint16_t)mode16 << 10u));
                uint16_t received = (uint16_t)(0xd500u | ((uint16_t)channel << 4u) |
                                               ((uint16_t)master << 3u) | mode16);
                uint16_t expected = mode16 != 0u ? received : received & 0x00ffu;
                uint64_t cycles = master != 0u ? transfer_cycles(control) : 1u;
                uint8_t value;
                bool scheduled;

                dspic33_reset(cpu, 0u);
                configure_spi(cpu, channel, control, 0u, 0u);
                scheduled = dspic33_spi_receive(cpu, channel, received, cycles);
                dspic33_write_word(cpu, (uint16_t)(base + 8u), 0xa55au);
                expect(state,
                       cpu->io.spi_tx[channel].count == 0u &&
                           !dspic33_spi_transmit(cpu, channel, &value),
                       "receive-only suppresses serial output");
                expect(state, scheduled && dspic33_device_advance(cpu, cycles),
                       "receive-only transfer completes");
                expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == expected,
                       "receive-only retains input");
                expect(state, interrupt_flag(cpu, irqs[channel]),
                       "receive-only raises transfer interrupt");
                expect(state, cpu->io.spi_tx[channel].count == 0u,
                       "receive-only transfer emits no output");

                clear_interrupt(cpu, irqs[channel]);
                dspic33_write_word(cpu, (uint16_t)(base + 2u),
                                   (uint16_t)(control & ~0x0800u));
                dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x5aa5u);
                expect(state,
                       dspic33_spi_transmit(cpu, channel, &value) && value == 0xa5u &&
                           cpu->io.spi_tx[channel].count == (mode16 != 0u ? 1u : 0u),
                       "serial output resumes after receive-only mode");
            }
        }
    }
}

static void physical_slave_input_cases(SpiConformance* state, Dspic33* cpu,
                                       Dspic33* copy) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint8_t mode16;
        for (mode16 = 0u; mode16 < 2u; mode16++) {
            uint8_t polarity;
            for (polarity = 0u; polarity < 2u; polarity++) {
                uint8_t edge;
                for (edge = 0u; edge < 2u; edge++) {
                    uint16_t base = bases[channel];
                    uint16_t control =
                        (uint16_t)(((uint16_t)mode16 << 10u) | ((uint16_t)edge << 8u) |
                                   0x0080u | ((uint16_t)polarity << 6u) | 0x001bu);
                    uint16_t received = (uint16_t)(0xa500u | ((uint16_t)channel << 4u) |
                                                   ((uint16_t)polarity << 2u) |
                                                   ((uint16_t)edge << 1u) | mode16);
                    uint16_t expected = mode16 != 0u ? received : received & 0x00ffu;
                    uint8_t width = mode16 != 0u ? 16u : 8u;
                    bool idle = polarity != 0u;
                    bool accepted = true;
                    uint8_t index;

                    dspic33_reset(cpu, 0u);
                    accepted &= dspic33_spi_pin_input(cpu, channel, idle, false, false);
                    configure_spi(cpu, channel, control, 0u, 0u);
                    for (index = 0u; index < width; index++) {
                        bool high =
                            (received & (uint16_t)(1u << (width - index - 1u))) != 0u;
                        accepted &=
                            dspic33_spi_pin_input(cpu, channel, !idle, high, false);
                        accepted &=
                            dspic33_spi_pin_input(cpu, channel, idle, high, false);
                        if (index + 1u != width) {
                            accepted &= !interrupt_flag(cpu, irqs[channel]);
                        }
                    }
                    expect(state, accepted, "physical slave accepts exact clock edges");
                    expect(state,
                           interrupt_flag(cpu, irqs[channel]) &&
                               dspic33_read_word(cpu, (uint16_t)(base + 8u)) ==
                                   expected,
                           "physical slave receives serial input");

                    clear_interrupt(cpu, irqs[channel]);
                    accepted = dspic33_spi_pin_input(cpu, channel, idle, false, true);
                    for (index = 0u; index < width; index++) {
                        accepted &=
                            dspic33_spi_pin_input(cpu, channel, !idle, true, true);
                        accepted &=
                            dspic33_spi_pin_input(cpu, channel, idle, true, true);
                    }
                    expect(state,
                           accepted && !interrupt_flag(cpu, irqs[channel]) &&
                               (dspic33_read_word(cpu, base) & 1u) == 0u,
                           "deselected physical slave ignores serial input");
                }
            }
        }
    }
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint8_t polarity;
        for (polarity = 0u; polarity < 2u; polarity++) {
            uint16_t base = bases[channel];
            uint16_t received =
                (uint16_t)(0x0060u | ((uint16_t)channel << 1u) | polarity);
            bool active = polarity != 0u;
            bool accepted = true;
            uint8_t index;

            dspic33_reset(cpu, 0u);
            accepted &= dspic33_spi_pin_input(cpu, channel, false, false, !active);
            configure_spi(cpu, channel, 0x001bu,
                          (uint16_t)(0xc000u | ((uint16_t)polarity << 13u)), 0u);
            accepted &= dspic33_spi_pin_input(cpu, channel, false, false, active);
            for (index = 0u; index < 8u; index++) {
                bool high = (received & (uint16_t)(0x0080u >> index)) != 0u;
                accepted &= dspic33_spi_pin_input(cpu, channel, true, high, active);
                accepted &= dspic33_spi_pin_input(cpu, channel, false, high, active);
            }
            expect(state,
                   accepted && interrupt_flag(cpu, irqs[channel]) &&
                       dspic33_read_word(cpu, (uint16_t)(base + 8u)) == received,
                   "framed slave accepts selected physical input");

            clear_interrupt(cpu, irqs[channel]);
            accepted = dspic33_spi_pin_input(cpu, channel, false, false, !active);
            for (index = 0u; index < 8u; index++) {
                accepted &= dspic33_spi_pin_input(cpu, channel, true, true, !active);
                accepted &= dspic33_spi_pin_input(cpu, channel, false, true, !active);
            }
            expect(state, accepted && !interrupt_flag(cpu, irqs[channel]),
                   "framed slave rejects inactive physical input");
        }
    }
    expect(state, !dspic33_spi_pin_input(cpu, DSPIC33_SPI_COUNT, false, false, false),
           "physical slave rejects invalid channel");

    dspic33_reset(cpu, 0u);
    dspic33_spi_pin_input(cpu, 0u, false, false, false);
    configure_spi(cpu, 0u, 0x049bu, 0u, 0u);
    for (uint8_t index = 0u; index < 8u; index++) {
        bool high = (0xa55au & (uint16_t)(1u << (15u - index))) != 0u;
        dspic33_spi_pin_input(cpu, 0u, true, high, false);
        dspic33_spi_pin_input(cpu, 0u, false, high, false);
    }
    expect(state, dspic33_copy(copy, cpu), "copy partial physical slave input");
    expect(state,
           copy->io.spi_pin_bits[0] == 8u && copy->io.spi_pin_receive[0] == 0x00a5u,
           "copied physical slave retains partial word");
    for (uint8_t index = 8u; index < 16u; index++) {
        bool high = (0xa55au & (uint16_t)(1u << (15u - index))) != 0u;
        dspic33_spi_pin_input(copy, 0u, true, high, false);
        dspic33_spi_pin_input(copy, 0u, false, high, false);
    }
    expect(state,
           interrupt_flag(copy, irqs[0]) && dspic33_read_word(copy, 0x0248u) == 0xa55au,
           "copied physical slave completes independently");
    expect(state,
           !interrupt_flag(cpu, irqs[0]) && cpu->io.spi_pin_bits[0] == 8u &&
               cpu->io.spi_pin_receive[0] == 0x00a5u,
           "source physical slave remains partial");
    dspic33_reset(cpu, 0u);
    expect(state,
           cpu->io.spi_pin_bits[0] == 0u && cpu->io.spi_pin_receive[0] == 0u &&
               cpu->io.spi_pin_clock_high == 0u && cpu->io.spi_pin_select_high == 0u,
           "reset clears physical slave state");
}

static void pps_slave_input_cases(SpiConformance* state, Dspic33* cpu) {
    static const uint8_t channels[] = {0u, 2u, 3u};
    static const uint16_t input_registers[] = {0x06c8u, 0x06dau, 0x06deu};
    static const uint16_t select_registers[] = {0x06cau, 0x06dcu, 0x06e0u};
    size_t channel_index;
    for (channel_index = 0u; channel_index < sizeof(channels) / sizeof(channels[0]);
         channel_index++) {
        uint8_t mode16;
        for (mode16 = 0u; mode16 < 2u; mode16++) {
            uint8_t channel = channels[channel_index];
            uint16_t base = bases[channel];
            uint16_t control = (uint16_t)(0x019bu | ((uint16_t)mode16 << 10u));
            uint16_t received = mode16 != 0u ? 0xa55au : 0x005au;
            uint8_t width = mode16 != 0u ? 16u : 8u;

            dspic33_reset(cpu, 0u);
            dspic33_write_word(cpu, 0x0e3eu,
                               (uint16_t)(dspic33_read_word(cpu, 0x0e3eu) & ~0x0007u));
            dspic33_write_word(cpu, 0x0e30u,
                               (uint16_t)(dspic33_read_word(cpu, 0x0e30u) | 0x0007u));
            dspic33_gpio_drive(cpu, 3u, 0x0004u, 0x0007u);
            dspic33_write_word(cpu, input_registers[channel_index], 0x4140u);
            dspic33_write_word(cpu, select_registers[channel_index], 66u);
            configure_spi(cpu, channel, control, 0u, 0u);
            expect(state,
                   dspic33_gpio_drive(cpu, 3u, 0u, 0x0004u) &&
                       drive_pps_spi_word(cpu, received, width, 0x0001u, 0x0002u) &&
                       interrupt_flag(cpu, irqs[channel]) &&
                       dspic33_read_word(cpu, (uint16_t)(base + 8u)) == received,
                   "mapped PPS slave receives serial input");
        }
    }

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e3eu,
                       (uint16_t)(dspic33_read_word(cpu, 0x0e3eu) & ~0x005fu));
    dspic33_write_word(cpu, 0x0e30u,
                       (uint16_t)(dspic33_read_word(cpu, 0x0e30u) | 0x005fu));
    dspic33_gpio_drive(cpu, 3u, 0u, 0x005fu);
    dspic33_write_word(cpu, 0x06c8u, 0x4640u);
    configure_spi(cpu, 0u, 0x011bu, 0u, 0u);
    expect(state, !interrupt_flag(cpu, irqs[0]) && cpu->io.spi_pin_bits[0] == 0u,
           "PPS slave starts without a sampled edge");
    dspic33_write_word(cpu, 0x0e3eu,
                       (uint16_t)(dspic33_read_word(cpu, 0x0e3eu) | 0x0040u));
    expect(state, (dspic33_read_word(cpu, 0x0e3eu) & 0x0040u) != 0u,
           "PPS slave clock pin enters analog mode");
    expect(state, drive_pps_spi_word(cpu, 0x00a5u, 8u, 0x0001u, 0x0040u),
           "drive analog PPS slave input");
    expect(state, !interrupt_flag(cpu, irqs[0]),
           "analog PPS clock suppresses slave interrupt");
    expect(state, cpu->io.spi_pin_bits[0] == 0u,
           "analog PPS clock suppresses sampled bits");
    dspic33_write_word(cpu, 0x0e3eu,
                       (uint16_t)(dspic33_read_word(cpu, 0x0e3eu) & ~0x0040u));
    expect(state,
           drive_pps_spi_word(cpu, 0x00a5u, 8u, 0x0001u, 0x0040u) &&
               interrupt_flag(cpu, irqs[0]) && dspic33_read_word(cpu, 0x0248u) == 0xa5u,
           "digital PPS clock restores slave input");

    clear_interrupt(cpu, irqs[0]);
    dspic33_write_word(cpu, 0x0e30u,
                       (uint16_t)(dspic33_read_word(cpu, 0x0e30u) & ~0x0040u));
    expect(state,
           drive_pps_spi_word(cpu, 0x005au, 8u, 0x0001u, 0x0040u) &&
               !interrupt_flag(cpu, irqs[0]),
           "output-configured PPS clock suppresses slave input");
    dspic33_write_word(cpu, 0x0e30u,
                       (uint16_t)(dspic33_read_word(cpu, 0x0e30u) | 0x0040u));
    expect(state,
           drive_pps_spi_word(cpu, 0x005au, 8u, 0x0001u, 0x0040u) &&
               interrupt_flag(cpu, irqs[0]) && dspic33_read_word(cpu, 0x0248u) == 0x5au,
           "input-configured PPS clock restores slave input");

    clear_interrupt(cpu, irqs[0]);
    dspic33_write_word(cpu, 0x06c8u, 0x4443u);
    expect(state,
           drive_pps_spi_word(cpu, 0x00ffu, 8u, 0x0001u, 0x0002u) &&
               !interrupt_flag(cpu, irqs[0]),
           "live PPS remap releases old slave inputs");
    expect(state,
           drive_pps_spi_word(cpu, 0x003cu, 8u, 0x0008u, 0x0010u) &&
               interrupt_flag(cpu, irqs[0]) && dspic33_read_word(cpu, 0x0248u) == 0x3cu,
           "live PPS remap selects new slave inputs");

    clear_interrupt(cpu, irqs[0]);
    dspic33_write_word(cpu, 0x06c8u, 0x0201u);
    expect(state,
           drive_pps_spi_word(cpu, 0x00ffu, 8u, 0x0008u, 0x0010u) &&
               !interrupt_flag(cpu, irqs[0]),
           "B1 virtual PPS sources do not drive SPI input");
}

static void master_output_cases(SpiConformance* state, Dspic33* cpu, Dspic33* copy) {
    static const uint16_t mappings[DSPIC33_SPI_COUNT] = {0x0605u, 0u, 0x201fu, 0x2322u};
    uint8_t channel;
    bool clock;
    bool data;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint8_t mode16;
        for (mode16 = 0u; mode16 < 2u; mode16++) {
            uint8_t polarity;
            for (polarity = 0u; polarity < 2u; polarity++) {
                uint8_t edge;
                for (edge = 0u; edge < 2u; edge++) {
                    uint16_t control =
                        (uint16_t)(0x003bu | ((uint16_t)mode16 << 10u) |
                                   ((uint16_t)edge << 8u) | ((uint16_t)polarity << 6u));
                    uint16_t value = mode16 != 0u ? 0xa55bu : 0x00a5u;
                    uint64_t cycles = transfer_cycles(control);

                    dspic33_reset(cpu, 0u);
                    if (mappings[channel] != 0u) {
                        dspic33_write_word(cpu, 0x0680u, mappings[channel]);
                    }
                    configure_spi(cpu, channel, control, 0u, 0u);
                    dspic33_write_word(cpu, (uint16_t)(bases[channel] + 8u), value);
                    expect(state,
                           dspic33_spi_clock_output(cpu, channel, &clock) &&
                               clock == (polarity == 0u) &&
                               dspic33_spi_data_output(cpu, channel, &data) && data &&
                               (mappings[channel] == 0u ||
                                (dspic33_spi_pin(cpu, 64u, &data) && data &&
                                 dspic33_spi_pin(cpu, 65u, &clock) &&
                                 clock == (polarity == 0u))),
                           "master output starts on active clock with first data bit");
                    expect(state,
                           dspic33_device_advance(cpu, 1u) &&
                               dspic33_spi_clock_output(cpu, channel, &clock) &&
                               clock == (polarity != 0u) &&
                               dspic33_spi_data_output(cpu, channel, &data) &&
                               data == (edge == 0u),
                           "master output reaches half-clock data phase");
                    expect(state,
                           dspic33_device_advance(cpu, 1u) &&
                               dspic33_spi_clock_output(cpu, channel, &clock) &&
                               clock == (polarity == 0u) &&
                               dspic33_spi_data_output(cpu, channel, &data) && !data,
                           "master output advances to second data bit");
                    expect(state,
                           dspic33_device_advance(cpu, cycles - 2u) &&
                               dspic33_spi_clock_output(cpu, channel, &clock) &&
                               clock == (polarity != 0u) &&
                               dspic33_spi_data_output(cpu, channel, &data) && data,
                           "master output returns to idle clock with final data bit");
                }
            }
        }

        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, 0x183bu, 0u, 0u);
        dspic33_write_word(cpu, (uint16_t)(bases[channel] + 8u), 0x00a5u);
        expect(state,
               !dspic33_spi_clock_output(cpu, channel, &clock) &&
                   !dspic33_spi_data_output(cpu, channel, &data),
               "disabled master pins release clock and data outputs");

        dspic33_reset(cpu, 0u);
        dspic33_device_advance(cpu, 1u);
        configure_spi(cpu, channel, 0x003bu, 0x8000u, 0u);
        expect(state, dspic33_spi_clock_output(cpu, channel, &clock) && clock,
               "framed master clock starts from its enable cycle");
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   dspic33_spi_clock_output(cpu, channel, &clock) && !clock,
               "framed master clock reaches continuous half-cycle");
        dspic33_write_word(cpu, (uint16_t)(bases[channel] + 8u), 0x00a5u);
        expect(state, dspic33_spi_clock_output(cpu, channel, &clock) && !clock,
               "framed transmit does not restart continuous clock phase");
    }

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0680u, 0x0605u);
    configure_spi(cpu, 0u, 0x003bu, 0u, 0u);
    dspic33_write_word(cpu, 0x0248u, 0x00a5u);
    dspic33_write_word(cpu, 0x0680u, 0u);
    expect(state,
           !dspic33_spi_pin(cpu, 64u, &data) && !dspic33_spi_pin(cpu, 65u, &clock) &&
               dspic33_spi_data_output(cpu, 0u, &data) && data,
           "live remap releases master outputs without stopping transfer");
    expect(state,
           !dspic33_spi_clock_output(cpu, DSPIC33_SPI_COUNT, &clock) &&
               !dspic33_spi_data_output(cpu, DSPIC33_SPI_COUNT, &data) &&
               !dspic33_spi_pin(cpu, 0u, &data) && !dspic33_spi_pin(cpu, 64u, NULL),
           "master output rejects invalid requests");

    dspic33_reset(cpu, 0u);
    configure_spi(cpu, 0u, 0x003bu, 0u, 0u);
    dspic33_write_word(cpu, 0x0248u, 0x00a5u);
    dspic33_device_advance(cpu, 1u);
    expect(state, dspic33_copy(copy, cpu), "copy active master output phase");
    expect(state,
           dspic33_spi_clock_output(cpu, 0u, &clock) && !clock &&
               dspic33_spi_clock_output(copy, 0u, &data) && !data,
           "copied master output retains half-clock phase");
    dspic33_device_advance(cpu, 1u);
    expect(state,
           dspic33_spi_clock_output(cpu, 0u, &clock) && clock &&
               dspic33_spi_clock_output(copy, 0u, &data) && !data,
           "copied master output advances independently");
}

static void timing_matrix_cases(SpiConformance* state, Dspic33* cpu) {
    uint8_t channel;
    uint8_t mode16;
    uint8_t primary;
    uint8_t secondary;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        for (mode16 = 0u; mode16 < 2u; mode16++) {
            for (primary = 0u; primary < 4u; primary++) {
                for (secondary = 0u; secondary < 8u; secondary++) {
                    uint16_t control;
                    uint16_t sent;
                    uint16_t received;
                    uint64_t cycles;
                    if (primary == 3u && secondary == 7u) {
                        continue;
                    }
                    control =
                        (uint16_t)(0x0020u | primary | ((uint16_t)secondary << 2u) |
                                   (mode16 != 0u ? 0x0400u : 0u));
                    sent = (uint16_t)(0x8100u | (channel << 4u) | (primary << 2u) |
                                      (secondary & 3u));
                    received = (uint16_t)(0x5a00u | (secondary << 4u) | primary);
                    cycles = transfer_cycles(control);
                    dspic33_reset(cpu, 0u);
                    configure_spi(cpu, channel, control, 0u, 0u);
                    expect(state, dspic33_spi_receive(cpu, channel, received, cycles),
                           "schedule master response matrix");
                    dspic33_write_word(cpu, (uint16_t)(bases[channel] + 8u), sent);
                    expect(state,
                           (dspic33_read_word(cpu, bases[channel]) & 0x0080u) == 0u,
                           "matrix shift register active");
                    expect(state, dspic33_device_advance(cpu, cycles - 1u),
                           "matrix advance before completion");
                    expect(state,
                           (dspic33_read_word(cpu, bases[channel]) & 0x0001u) == 0u,
                           "matrix not complete early");
                    expect(state, dspic33_device_advance(cpu, 1u),
                           "matrix completion advance");
                    expect(state,
                           (dspic33_read_word(cpu, bases[channel]) & 0x0001u) != 0u,
                           "matrix receive flag");
                    expect(
                        state,
                        dspic33_read_word(cpu, (uint16_t)(bases[channel] + 8u)) ==
                            (mode16 != 0u ? received : (uint16_t)(received & 0x00ffu)),
                        "matrix received value");
                    expect(state, interrupt_flag(cpu, irqs[channel]),
                           "matrix transfer interrupt");
                }
            }
        }
    }
}

