tylertms/dspic33e-sim/conformance/spi.c
static void mode_transition_cases(SpiConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint16_t base = bases[channel];
        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, 0x003bu, 0u, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x00aau);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x043bu);
        expect(state,
               cpu->io.spi_tx_fifo[channel].count == 0u &&
                   (cpu->io.spi_busy & (uint8_t)(1u << channel)) == 0u,
               "mode width change resets transfer");
        expect(state, (dspic33_read_word(cpu, base) & 0x0003u) == 0u,
               "mode width change clears flags");

        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0xaaaau);
        dspic33_write_word(cpu, (uint16_t)(base + 4u), 1u);
        expect(state,
               cpu->io.spi_tx_fifo[channel].count == 0u &&
                   (cpu->io.spi_busy & (uint8_t)(1u << channel)) == 0u,
               "enhanced mode change resets transfer");
        expect(state, (dspic33_read_word(cpu, base) & 0x00a0u) == 0x00a0u,
               "enhanced mode reset status");

        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0xbbbbu);
        dspic33_write_word(cpu, base, 0u);
        expect(state,
               cpu->io.spi_tx_fifo[channel].count == 0u &&
                   (cpu->io.spi_busy & (uint8_t)(1u << channel)) == 0u,
               "module disable resets transfer");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0u,
               "module disable clears buffer");
    }
}

static void selection_and_frame_cases(SpiConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint16_t base = bases[channel];
        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, 0x0480u, 0u, 0u);
        expect(state,
               dspic33_spi_receive(cpu, channel, 0x1111u, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "unselected slave transaction advance");
        expect(state, (dspic33_read_word(cpu, base) & 1u) == 0u,
               "unselected slave transaction ignored");
        expect(state,
               dspic33_spi_select(cpu, channel, true, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "select slave");
        expect(state,
               dspic33_spi_receive(cpu, channel, 0x2222u, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "selected slave transaction advance");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0x2222u,
               "selected slave transaction received");

        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, 0x0400u, 0xc000u, 0u);
        expect(state,
               dspic33_spi_receive(cpu, channel, 0x3333u, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "inactive frame transaction advance");
        expect(state, (dspic33_read_word(cpu, base) & 1u) == 0u,
               "inactive frame transaction ignored");
        expect(state,
               dspic33_spi_select(cpu, channel, true, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   dspic33_spi_receive(cpu, channel, 0x4444u, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "active frame transaction advance");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0x4444u,
               "active frame transaction received");
    }
}

static void b1_frame_output_cases(SpiConformance* state, Dspic33* cpu, Dspic33* copy) {
    static const uint8_t frame_functions[DSPIC33_SPI_COUNT] = {7u, 10u, 33u, 36u};
    uint8_t channel;
    bool high = false;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint8_t bit = (uint8_t)(1u << channel);
        uint8_t master;
        for (master = 0u; master < 2u; master++) {
            uint8_t polarity;
            for (polarity = 0u; polarity < 2u; polarity++) {
                uint8_t delay;
                for (delay = 0u; delay < 2u; delay++) {
                    uint16_t control = master != 0u ? 0x043bu : 0x0400u;
                    uint16_t control2 =
                        (uint16_t)(0x8000u | ((uint16_t)polarity << 13u) |
                                   ((uint16_t)delay << 1u));
                    uint16_t received = (uint16_t)(0xd800u + ((uint16_t)channel << 4u) +
                                                   ((uint16_t)master << 3u) +
                                                   ((uint16_t)polarity << 2u) + delay);
                    uint16_t transmitted =
                        (uint16_t)(0xa500u + ((uint16_t)channel << 4u) +
                                   ((uint16_t)master << 3u) +
                                   ((uint16_t)polarity << 2u) + delay);
                    bool starts_active =
                        polarity != 0u && (master == 0u || delay == 0u);
                    dspic33_reset(cpu, 0u);
                    configure_spi(cpu, channel, control, control2, 0u);
                    expect(state,
                           dspic33_spi_frame_output(cpu, channel, &high) &&
                               high == (polarity == 0u),
                           "B1 frame output starts at inactive polarity");
                    dspic33_write_word(cpu, (uint16_t)(base + 8u), transmitted);
                    expect(state,
                           dspic33_read_word(cpu, (uint16_t)(base + 4u)) == control2 &&
                               dspic33_spi_frame_output(cpu, channel, &high) &&
                               high == (starts_active || polarity == 0u) &&
                               ((cpu->io.spi_frame_active & bit) != 0u) ==
                                   starts_active &&
                               cpu->events.count ==
                                   (master != 0u
                                        ? (polarity != 0u && delay != 0u ? 2u : 1u)
                                        : 0u),
                           "B1 framed master applies polarity and delay behavior");
                    if (master != 0u) {
                        uint64_t cycles = transfer_cycles(control);
                        if (polarity != 0u && delay != 0u) {
                            uint64_t clock = cycles / 16u;
                            expect(state,
                                   dspic33_device_advance(cpu, clock) &&
                                       dspic33_spi_frame_output(cpu, channel, &high) &&
                                       high,
                                   "master delayed frame begins with first clock");
                            cycles -= clock;
                        }
                        expect(state, dspic33_device_advance(cpu, cycles),
                               "B1 master frame transfer completes");
                    } else {
                        expect(state,
                               dspic33_spi_receive(cpu, channel, received, 1u) &&
                                   dspic33_device_advance(cpu, 1u),
                               "B1 slave framed master transfer completes");
                    }
                    expect(state,
                           dspic33_spi_frame_output(cpu, channel, &high) &&
                               high == (polarity == 0u) &&
                               (cpu->io.spi_frame_active & bit) == 0u &&
                               dspic33_read_word(cpu, (uint16_t)(base + 8u)) ==
                                   (master != 0u ? transmitted : received),
                           "B1 frame returns to inactive polarity after transfer");
                }
            }
        }

        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, 0x043bu, 0xa000u, 0u);
        dspic33_write_word(cpu, 0x0680u, frame_functions[channel]);
        expect(state, dspic33_spi_frame_pin(cpu, 64u, &high) && !high,
               "mapped B1 frame pin starts inactive");
        dspic33_write_word(cpu, (uint16_t)(base + 8u), (uint16_t)(0xe100u + channel));
        expect(state, dspic33_spi_frame_pin(cpu, 64u, &high) && high,
               "mapped B1 frame pin follows active pulse");
        dspic33_write_word(cpu, 0x0680u, 0u);
        expect(state, !dspic33_spi_frame_pin(cpu, 64u, &high),
               "B1 frame pin releases after live remap");
        dspic33_write_word(cpu, 0x0680u, frame_functions[channel]);
        expect(state,
               dspic33_device_advance(cpu, transfer_cycles(0x043bu)) &&
                   dspic33_spi_frame_pin(cpu, 64u, &high) && !high,
               "remapped B1 frame pin follows transfer completion");
        dspic33_write_word(cpu, (uint16_t)(base + 4u), 0x8000u);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), (uint16_t)(0xe200u + channel));
        expect(state,
               dspic33_spi_frame_pin(cpu, 64u, &high) && high &&
                   (cpu->io.spi_frame_active & bit) == 0u,
               "mapped B1 frame pin suppresses active-low pulse");
        expect(state,
               dspic33_device_advance(cpu, transfer_cycles(0x043bu)) &&
                   dspic33_spi_frame_pin(cpu, 64u, &high) && high,
               "mapped B1 active-low frame remains inactive after transfer");
    }

    dspic33_reset(cpu, 0u);
    configure_spi(cpu, 0u, 0x043bu, 0xa000u, 0u);
    dspic33_write_word(cpu, 0x0248u, 0xea5eu);
    expect(state, dspic33_copy(copy, cpu), "copy active B1 frame output");
    expect(state,
           dspic33_spi_frame_output(cpu, 0u, &high) && high &&
               dspic33_spi_frame_output(copy, 0u, &high) && high,
           "copied B1 frame output remains active");
    expect(state, dspic33_device_advance(copy, transfer_cycles(0x043bu)),
           "copied B1 frame transfer completes");
    expect(state,
           dspic33_spi_frame_output(copy, 0u, &high) && !high &&
               dspic33_spi_frame_output(cpu, 0u, &high) && high,
           "copied B1 frame output advances independently");
    dspic33_reset(cpu, 0u);
    expect(state,
           cpu->io.spi_frame_active == 0u &&
               !dspic33_spi_frame_output(cpu, 0u, &high) &&
               !dspic33_spi_frame_output(cpu, DSPIC33_SPI_COUNT, &high) &&
               !dspic33_spi_frame_output(cpu, 0u, NULL) &&
               !dspic33_spi_frame_pin(cpu, 0u, &high) &&
               !dspic33_spi_frame_pin(cpu, 64u, NULL),
           "reset and invalid access release B1 frame output");
}

static void clock_and_power_cases(SpiConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint16_t control = 0x143bu;
        uint64_t cycles = transfer_cycles(control);
        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, control, 0u, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x1111u);
        expect(state, cpu->events.count == 0u, "disabled clock does not schedule");
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x043bu);
        expect(state, cpu->events.count == 1u, "clock enable resumes transfer");
        expect(state, dspic33_device_advance(cpu, cycles),
               "resumed clock completion advance");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0x1111u,
               "resumed clock transfer value");

        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, 0x043bu, 0u, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x2222u);
        cpu->power_state = DSPIC33_POWER_SLEEP;
        expect(state, dspic33_device_advance(cpu, cycles),
               "master sleep transfer advance");
        expect(state,
               (dspic33_read_word(cpu, base) & 1u) == 0u &&
                   (cpu->io.spi_busy & (uint8_t)(1u << channel)) == 0u,
               "master sleep aborts transfer");

        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, 0x0400u, 0u, 0u);
        cpu->power_state = DSPIC33_POWER_SLEEP;
        expect(state,
               dspic33_spi_receive(cpu, channel, 0x3333u, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "slave sleep transaction advance");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0x3333u,
               "slave sleep completes transfer");

        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, 0x043bu, 0u, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x4444u);
        cpu->power_state = DSPIC33_POWER_IDLE;
        expect(state, dspic33_device_advance(cpu, cycles),
               "master idle running advance");
        expect(state, (dspic33_read_word(cpu, base) & 1u) != 0u,
               "master idle continues by default");

        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, 0x043bu, 0u, 0u);
        dspic33_write_word(cpu, base, 0xa000u);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x5555u);
        cpu->power_state = DSPIC33_POWER_IDLE;
        expect(state, dspic33_device_advance(cpu, cycles),
               "master stopped idle advance");
        expect(state,
               (dspic33_read_word(cpu, base) & 1u) == 0u &&
                   (cpu->io.spi_busy & (uint8_t)(1u << channel)) == 0u,
               "master stopped idle aborts transfer");
    }
}

static void pmd_cases(SpiConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint16_t pmd_address = channel < 2u ? 0x0760u : 0x076au;
        uint16_t pmd_bit = channel < 2u ? (uint16_t)(0x0008u << channel)
                                        : (uint16_t)(1u << (channel - 2u));
        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, 0x043bu, 0u, 0u);
        dspic33_write_word(cpu, pmd_address,
                           (uint16_t)(dspic33_read_word(cpu, pmd_address) | pmd_bit));
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0xaaaau);
        expect(state, (cpu->io.spi_busy & (uint8_t)(1u << channel)) == 0u,
               "pmd blocks transfer");
        dspic33_write_word(cpu, pmd_address,
                           (uint16_t)(dspic33_read_word(cpu, pmd_address) & ~pmd_bit));
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0xbbbbu);
        expect(state, (cpu->io.spi_busy & (uint8_t)(1u << channel)) != 0u,
               "pmd clear restores transfer");
    }
}

static void dma_cases(SpiConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint16_t control = 0x043bu;
        uint64_t cycles = transfer_cycles(control);
        uint16_t rx_memory = (uint16_t)(0x5000u + channel * 0x20u);
        uint16_t tx_memory = (uint16_t)(rx_memory + 0x10u);
        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, control, 0u, 0u);
        configure_dma(cpu, 0u, 0x0001u, requests[channel], rx_memory,
                      (uint16_t)(base + 8u), 0u);
        expect(state, dspic33_spi_receive(cpu, channel, 0x6a00u + channel, cycles),
               "schedule dma receive response");
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x1000u + channel);
        expect(state, dspic33_device_advance(cpu, cycles),
               "dma receive completion advance");
        expect(state, dspic33_read_word(cpu, rx_memory) == 0x6a00u + channel,
               "dma receive value");
        expect(state,
               (dspic33_read_word(cpu, dma_base(0u)) & 0x8000u) != 0u &&
                   !interrupt_flag(cpu, 4u) && cpu->io.dma_index[0] == 0u,
               "dma receive active before completion");
        expect(state, dspic33_device_advance(cpu, 1u),
               "dma receive controller completion advance");
        expect(state,
               (dspic33_read_word(cpu, dma_base(0u)) & 0x8000u) == 0u &&
                   interrupt_flag(cpu, 4u),
               "dma receive one shot complete");

        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, control, 0u, 0u);
        dspic33_write_word(cpu, tx_memory, 0x7b00u + channel);
        configure_dma(cpu, 1u, 0x2001u, requests[channel], tx_memory,
                      (uint16_t)(base + 8u), 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x2000u + channel);
        expect(state, dspic33_device_advance(cpu, cycles),
               "dma transmit request advance");
        expect(state, cpu->io.spi_shift[channel] == 0x7b00u + channel,
               "dma transmit loads next shift");
        expect(state,
               (dspic33_read_word(cpu, dma_base(1u)) & 0x8000u) != 0u &&
                   !interrupt_flag(cpu, 14u) && cpu->io.dma_index[1] == 0u,
               "dma transmit active before completion");
        expect(state, dspic33_device_advance(cpu, 1u),
               "dma transmit controller completion advance");
        expect(state,
               (dspic33_read_word(cpu, dma_base(1u)) & 0x8000u) == 0u &&
                   interrupt_flag(cpu, 14u),
               "dma transmit one shot complete");
        expect(state, dspic33_device_advance(cpu, cycles),
               "dma transmitted word completion");
        expect(state, cpu->io.spi_tx[channel].count == 4u,
               "dma transmit trace contains two words");

        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, control, 0u, 0u);
        dspic33_write_word(cpu, tx_memory, 0x8c00u + channel);
        configure_dma(cpu, 0u, 0x0001u, requests[channel], rx_memory,
                      (uint16_t)(base + 8u), 0u);
        configure_dma(cpu, 1u, 0x2001u, requests[channel], tx_memory,
                      (uint16_t)(base + 8u), 0u);
        expect(state, dspic33_spi_receive(cpu, channel, 0x9d00u + channel, cycles),
               "schedule duplex dma response");
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x3000u + channel);
        expect(state, dspic33_device_advance(cpu, cycles),
               "duplex dma completion advance");
        expect(state, dspic33_read_word(cpu, rx_memory) == 0x9d00u + channel,
               "duplex dma receive value");
        expect(state,
               cpu->io.spi_shift[channel] == 0x3000u + channel &&
                   cpu->io.dma_active == 1u,
               "duplex DMA receive channel has controller priority");
        expect(state, dspic33_device_advance(cpu, 1u),
               "duplex DMA receive completion and transmit start");
        expect(state, cpu->io.spi_shift[channel] == 0x8c00u + channel,
               "duplex dma transmit value");
    }
}

static void copy_and_reset_cases(SpiConformance* state, Dspic33* cpu, Dspic33* copy) {
    uint64_t cycles = transfer_cycles(0x043bu);
    dspic33_reset(cpu, 0u);
    dspic33_reset(copy, 0u);
    configure_spi(cpu, 0u, 0x043bu, 1u, 5u);
    dspic33_write_word(cpu, 0x0248u, 0xaaaau);
    dspic33_write_word(cpu, 0x0248u, 0xbbbbu);
    expect(state, dspic33_copy(copy, cpu), "copy spi state");
    expect(state,
           copy->io.spi_busy == cpu->io.spi_busy &&
               copy->io.spi_tx_fifo[0].count == cpu->io.spi_tx_fifo[0].count,
           "copied spi queues");
    expect(state, dspic33_device_advance(copy, cycles), "advance copied spi state");
    expect(state,
           copy->io.spi_rx_fifo[0].count == 1u && copy->io.spi_shift[0] == 0xbbbbu,
           "copied spi completes independently");
    expect(state, (dspic33_read_word(cpu, 0x0240u) & 1u) == 0u,
           "source spi remains pending");
    dspic33_reset(cpu, 0u);
    expect(state,
           cpu->io.spi_busy == 0u && cpu->io.spi_tx_fifo[0].count == 0u &&
               cpu->io.spi_rx_fifo[0].count == 0u,
           "reset clears spi state");
    expect(state,
           dspic33_read_word(cpu, 0x0240u) == 0u &&
               dspic33_read_word(cpu, 0x0248u) == 0u,
           "reset clears spi registers");
}

int main(void) {
    SpiConformance state = {0u, 0u, 0u};
    Dspic33 cpu;
    Dspic33 copy;
    bool initialized = dspic33_initialize(&cpu);
    bool copy_initialized = dspic33_initialize(&copy);
    expect(&state, initialized, "initialize SPI processor");
    expect(&state, copy_initialized, "initialize SPI copy");
    if (initialized && copy_initialized) {
        register_cases(&state, &cpu);
        split_buffer_cases(&state, &cpu);
        transmit_output_cases(&state, &cpu);
        receive_only_cases(&state, &cpu);
        physical_slave_input_cases(&state, &cpu, &copy);
        pps_slave_input_cases(&state, &cpu);
        master_output_cases(&state, &cpu, &copy);
        timing_matrix_cases(&state, &cpu);
        standard_buffer_cases(&state, &cpu);
        enhanced_fifo_cases(&state, &cpu);
        interrupt_mode_cases(&state, &cpu);
        mode_transition_cases(&state, &cpu);
        selection_and_frame_cases(&state, &cpu);
        b1_frame_output_cases(&state, &cpu, &copy);
        clock_and_power_cases(&state, &cpu);
        pmd_cases(&state, &cpu);
        dma_cases(&state, &cpu);
        copy_and_reset_cases(&state, &cpu, &copy);
    }
    expect(&state, state.cases == 3108u, "SPI assertion accounting");
    if (copy_initialized) {
        dspic33_destroy(&copy);
    }
    if (initialized) {
        dspic33_destroy(&cpu);
    }
    report_sfr_side_effect_coverage(
        "spi", spi_sfr_side_effect_coverage,
        SFR_SIDE_EFFECT_COVERAGE_COUNT(spi_sfr_side_effect_coverage),
        state.failed == 0u);
    printf("[spi-summary] cases=%" PRIu32 " passed=%" PRIu32 " failed=%" PRIu32 "\n",
           state.cases, state.passed, state.failed);
    return state.failed == 0u ? 0 : 1;
}
